---
kind: other
id: Properties.T:Autodesk.Revit.DB.DirectContext3D.EffectInstance
source: html/239ce5e7-6b76-cdf4-ae39-46dc5e561a56.htm
---
# EffectInstance Properties

Specifies whether the .NET object represents a valid Revit entity.